app/controllers/api/v1/users_controller.rb

  def show
    respond_with User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    user = User.new(user_params)
    # if the user is saved successfully than respond with json data and status code 201
    if user.save
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

    def update
      user = User.find(params[:id])

      if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "users" SET "email" = $1, "encrypted_password" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "shruthichange@rails.com"], ["encrypted_password", "$2a$11$7IqR3hbDk/V9wE8Lp51kAuORMwCCjV7RmZ8jfSBXQaD82J/wt/6g2"], ["updated_at", "2016-10-20 14:42:13.012933"], ["id", 2]]